In [1]:
import pandas as pd

In [3]:
!ls -ltr

total 56
drwxr-xr-x@ 3 itversity  staff     96 Dec 21 10:09 data
-rw-r--r--@ 1 itversity  staff  22880 Dec 21 13:17 045 Using describe with Groups for Comparative Analysis.ipynb
-rw-r--r--@ 1 itversity  staff    442 Dec 21 13:19 035 Introduction to describe Method.ipynb

In [2]:
!ls -ltr data/car_sales

total 1016
-rw-r--r--@ 1 itversity  staff    1590 Dec 21 10:09 sales_reps_data.csv
-rw-r--r--@ 1 itversity  staff  240471 Dec 21 10:09 toyota_sales_data.csv
-rw-r--r--@ 1 itversity  staff  273161 Dec 21 10:09 toyota_sales_with_commission.csv

In [4]:
toyota_sales = pd.read_csv("data/car_sales/toyota_sales_data.csv")

In [5]:
toyota_sales.head()

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,NaN,Pending
2,3,5,2024-11-03,Corolla,20275.08,NaN,Completed
3,4,20,2024-11-06,Corolla,20068.93,NaN,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed

In [7]:
toyota_sales["sale_amount"].describe()

count     5000.000000
mean     32979.708214
std       7420.301088
min      20000.940000
25%      27259.710000
50%      32613.765000
75%      38751.005000
max      49995.680000
Name: sale_amount, dtype: float64

In [9]:
toyota_sales.dtypes

sale_id             int64
sale_rep_id         int64
sale_date          object
car_model          object
sale_amount       float64
commission_pct    float64
sale_status        object
dtype: object

In [11]:
toyota_sales[["sale_amount", "commission_pct"]].describe()

        sale_amount  commission_pct
count   5000.000000     3726.000000
mean   32979.708214        0.033725
std     7420.301088        0.012503
min    20000.940000        0.020000
25%    27259.710000        0.020000
50%    32613.765000        0.030000
75%    38751.005000        0.050000
max    49995.680000        0.050000

In [12]:
toyota_sales["commission_pct"].describe()

count    3726.000000
mean        0.033725
std         0.012503
min         0.020000
25%         0.020000
50%         0.030000
75%         0.050000
max         0.050000
Name: commission_pct, dtype: float64

In [13]:
toyota_sales["car_model"].value_counts()

car_model
RAV4          860
Camry         856
Corolla       827
Tacoma        826
Tundra        817
Highlander    814
Name: count, dtype: int64